-- phpMyAdmin SQL Dump
-- version 5.1.1deb5ubuntu1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Dec 14, 2022 at 02:22 PM
-- Server version: 8.0.31-0ubuntu0.22.04.1
-- PHP Version: 8.1.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `symfony_practical`
--

-- --------------------------------------------------------

--
-- Table structure for table `doctrine_migration_versions`
--

CREATE TABLE `doctrine_migration_versions` (
  `version` varchar(191) COLLATE utf8mb3_unicode_ci NOT NULL,
  `executed_at` datetime DEFAULT NULL,
  `execution_time` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;

--
-- Dumping data for table `doctrine_migration_versions`
--

INSERT INTO `doctrine_migration_versions` (`version`, `executed_at`, `execution_time`) VALUES
('DoctrineMigrations\\Version20221209140949', '2022-12-12 15:32:05', 57);

-- --------------------------------------------------------

--
-- Table structure for table `messenger_messages`
--

CREATE TABLE `messenger_messages` (
  `id` bigint NOT NULL,
  `body` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `headers` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue_name` varchar(190) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime NOT NULL,
  `available_at` datetime NOT NULL,
  `delivered_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `title`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, 'Антирейтинг IT-компаній, де звільнили найбільше фахівців у 2022 році', 'Спочатку менеджмент нерозбірливо наймає фахівців (пам’ятаєте, як минулого року сотнями брали людей на «лавку запасних», просто щоб були?), а при першому ж штормі на IT-ринку масово скорочує. І ти можеш втратити роботу не тому, що погано виконував свої обов’язки, а так — для кількості. Тому що не був найкращим. Тому що оптимізація. Неприємно, правда?', 'https://highload.today/wp-content/uploads/2022/12/2-2.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(2, 'Коли меми вже не смішать: три найпопулярніші проблеми в роботі рекрутера', 'Рекрутинг має бути smart. Робити масові розсилки розробникам в LinkedIn, не розуміючи специфіки позиції, — жахливо. Навіть меми про Java і JavaScript вже всім остогидли.', 'https://highload.today/wp-content/uploads/2022/12/mem.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(3, 'Розділяй та володарюй: що таке патерни MVC і MVP, та як їх використовувати', 'Ми постійно використовуємо патерни програмування, не усвідомлюючи цього. Не замислюємось про те, чому на проєктах використовується саме така архітектура, чому структуру проєкту і навіть назви файлів використовують за саме такими загальноприйнятими канонами.', 'https://highload.today/wp-content/uploads/2022/12/Gf9qJpCNHAQ-1.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(4, '«Впізнаваність, що переростає у зарплату»: як айтівцям ефективно і без клопоту вести LinkedIn', 'Багато айтівців завели акаунт у LinkedIn суто «для галочки», хоча це чудовий інструмент і для пошуку роботи, і для підвищення зарплати, і додаткове джерело доходу (коштом реклами). Спеціаліст зі створення персонального бренду Сем Браун з початку 2022 року зібрав 36 тисяч підписників з нуля і заробив $200 тисяч — він поділився порадами, як правильно вести соцмережу.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_333157022_L.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(5, '«Наш прототип – боти з продажу заборонених речовин». Кейс хлопців, чий бот за 5 хвилин оформлює поліс на авто', '2017 року харківські підприємці Віталій Дунаєв та Олександр Гарбуз створили сервіс онлайн-страхування Green Travel, а за три роки розробили перший в Україні Telegram-чат-бот, який за кілька хвилин оформлює страховий поліс на авто. ', 'https://highload.today/wp-content/uploads/2022/12/photo_2022-12-06_18-30-40.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(6, '11 причин, чому тебе не беруть на роботу в ІТ (і що робити)', 'Ти півроку тому закінчив дорогі курси, регулярно розсилаєш в IT-компанії резюме, і начебто все робиш правильно, але в кращому випадку вдається дійти до першого етапу співбесіди. QA Engineer і блогер Артем Русов у своєму Twitter виділив низку причин, чому не вдається знайти роботу.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_185036632_L.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(7, 'Що таке баг і як з ним боротися', 'Автор', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_137985986_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(8, 'Допоможіть посилити кібербезпеку бізнесу в Україні. Для цього потрібно взяти участь в опитуванні від CISO Ukraine', 'В Україні триває велике опитування з кібербезпеки бізнесу. Воно допоможе систематизувати дані про рівні кібербезпеки українських організацій і знайти стратегії та практики, які посилять її.', 'https://highload.today/wp-content/uploads/2022/12/ukfdyfz.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(9, 'Спробуйте нове: популярні варіанти використання AWS Lambda та 5 головних інструментів для роботи з нею', 'У своїй попередній статті на Highload я детально розповів про користь лямбда-функцій, які значно спрощують роботу девелопера.', 'https://highload.today/wp-content/uploads/2022/12/Gf9qJpCNHAQ.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(10, 'В рабстві у серіалів та соцмереж: чому ми підсідаємо на миттєву насолоду (і що з цим робити)', 'Увага — це спосіб, яким соціальні примати вимірюють статус. Це дуже корисно, оскільки викликає викид хімічних речовин у мозок, таких як допамін та ендорфіни', 'https://highload.today/wp-content/uploads/2022/12/black-mirror-caida-picado-288167.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(11, 'Не прогадайте: яку IT-спеціальність обрати у 2023 році — 11 найбільш затребуваних', 'Більшість айтівців в умовах війни зберегла за собою роботу і прибутки, які дозволяють активно донатити на армію та волонтерські проєкти: середній донат станом на червень 2022 року становив $270 на місяць (відповідно до результатів опитування на DOU).', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_514331542_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(12, '«Сюрприз» під ялинку: в Україні очікують масові скорочення найму — айтівці бояться міняти роботу', 'Більшість айтівців незадоволені своєю поточною роботою, але бояться звільнятися, щоби зовсім не залишитися без заробітку. Погіршують ситуацію невтішні прогнози експертів IT-ринку.', 'https://highload.today/wp-content/uploads/2022/12/yuvpk.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(13, 'Компанія припустилася помилки під час розробки. Що робити далі та як працює страхування ІТ-відповідальності', 'Colonnade – міжнародна страхова компанія, яка працює в Україні з 1998 року. У неї найвищий рейтинг надійності – ААА та немає відділень. Усі питання команда швидко вирішує онлайн. Серед клієнтів Colonnade великі корпорації та маленькі стартапи, багато з них надають послуги у сфері ІТ. ', 'https://highload.today/wp-content/uploads/2022/12/image-233.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(14, 'Як працює reduce() в JavaScript', 'журналист', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_451178260_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(15, 'Купуємо Starlink: які можуть бути проблеми та як налаштовувати обладнання', 'Айтівці, бізнесмени та волонтери продовжують скуповувати Starlink, щоб мати можливість працювати в умовах блекауту, відсутності зв’язку та наземного інтернету. Тим часом вартість обладнання піднялася з $500 до $700, а послуг Starlink в Україні — з $60 до $75 (2800 грн на місяць).', 'https://highload.today/wp-content/uploads/2022/12/tsukp.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(16, 'Не всі розробники це знають: як використовувати всі можливості AWS Lambda', 'Далеко не всі розробники знають про користь лямбда-функцій. І дарма! Адже ці хмарні функції можуть відчутно спростити роботу девелопера та підвищити ефективність створюваних застосунків. Особливо показова ця властивість на прикладі сервісу AWS Lambda від Amazon. Про це далі і піде мова.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_440387162_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(17, '10 коворкінгів з генераторами у західних регіонах України', 'На всій західній частині країни менше коворкінгів із генераторами, ніж в одному Києві, проте вони є! Тож, якщо русня знов надовго залишить ваш дім без світла, сміливо прямуйте сюди.', 'https://highload.today/wp-content/uploads/2022/12/281992043_553223903073896_9164753347862096463_n.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(18, '«Все це створив хтось інший»: що було у листі, який написав собі Стів Джобс в останні дні життя', 'Думаю, ви погодитесь, що Стіва Джобса можна вважати одним з найбільш натхненних і вмотивованих підприємців усіх часів.', 'https://highload.today/wp-content/uploads/2022/12/Steve_Jobs_Headshot_2010-CROP-1.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(19, 'Без світла: як працювати та жити у блекаут — перевірені поради', 'Ворожі обстріли обʼєктів української енергетичної інфраструктури не проходять безслідно. І блекаут 23-24 листопада це чітко продемонстрував. Ми з вами гідно пройшли це випробування. Але, на жаль, ситуація може повторитися і навіть ускладнитися. Тому ми маємо бути готовими.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_620149828_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(20, 'Будьте обережні: як змінилися методи шахраїв під час війни і чи можуть хакери рф «покласти» українські банки', 'Складні часи вимагають складних рішень — каже відомий вираз. І під час війни це стосується як екстраординарних рішень з боку громадян чи держави, так і з боку зловмисників різного калібру — від російських хакерів до фішерів.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_93203712_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(21, 'Запустили нові напрямки й залучаємо кошти: як проєкт «Сімейні молочні ферми» переживає війну', 'Сільське господарство в Україні, як і багато бізнесів, зараз переживає переломні часи. Проєкту «Сімейні молочні ферми» виповнилося вже п’ять років. Долучившись до нього, можна одночасно підтримати фермерів й отримати із цього дохід. А можливо це завдяки новому інструменту – інвестиційній позиці.', 'https://highload.today/wp-content/uploads/2022/12/preview.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(22, 'Нехай вимоги вакансії не лякають: які технології та інструменти знати, щоб стати фулстек-розробником', 'Читаєте вимоги вакансії для фулстек-розробника і цей перелік вас лякає? Не хвилюйтеся. Через деякий час, коли отримаєте більше досвіду, вам буде подобатись самостійно створювати продукти. ', 'https://highload.today/wp-content/uploads/2022/12/cca7ee74b27fc953d1e45dbb8fad5ff0.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(23, '«На третій день бою я підірвався на протитанковій міні»: історії з фронту від азовця-QA, що вижив', 'Публікуємо продовження історії азовця та QA-початківця Руслана Романова, що вижив після підриву на протитанковій міні — про страхи, найтяжчі спогади, саме поранення та місяці пекла на лікарняному ліжку.', 'https://highload.today/wp-content/uploads/2022/12/photo_2022-11-28_09-33-00-1.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(24, '22 коворкінги у Києві, де завжди є світло', 'Якщо вимкнули світло, у кафе на вас косо дивиться персонал, тому що ви на весь день «окупували» один із двох столиків, а в ТРЦ безсовісно закрили розетки, то для роботи залишаються лише коворкінги. Сьогодні публікуємо добірку «офісів на день» у столиці.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_83142150_L.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(25, '«Кривава» катастрофа Theranos: як «Стів Джобс у спідниці» стала головною шахрайкою Кремнієвої долини', 'У світлі краху криптобіржі FTX побутує думка, що «бульбашки» та шахрайство в IT — це перш за все про блокчейн. Але чи так це насправді?', 'https://highload.today/wp-content/uploads/2022/11/FiBTRDvWAAkKB6y-kopyya-1.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(26, '«Це цифровий наркотик»: як TikTok повільно знищує нове покоління (і старе теж)', 'TikTok швидко стає найдеструктивнішою соціальною мережею, що будь-коли існувала. Блогер та криптоінвестор Ісая МакКол вважає, що його інтерфейс спеціально розроблено для захоплення та скорочення тривалості уваги, він викликає допамінову залежность.', 'https://highload.today/wp-content/uploads/2022/12/Depositphotos_395059204_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(27, '«Немає агресії, болю, жалю до ворога — для мене це робота»: азовець про свій шлях в IT та війну зсередини', ' Життя бентежне — у будь-який момент все може розвернутися на 180 градусів. Сьогодні ти перукар і панкрокер, завтра — воїн. Потім вирішуєш змінити брудний окоп і автомат на ноутбук та офісне крісло, аж на порозі нового життя починається війна. Ще більш кривава і запекла, ніж ти знав.', 'https://highload.today/wp-content/uploads/2022/12/tsupf.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(28, 'Java String format: робота з ним та приклади', 'Сьогодні ми розберемося з форматуванням текстових та числових виразів у Java, попрацюємо з Java String format(), дізнаємося що таке специфікатори, які вони бувають і як ними користуватися.', 'https://highload.today/wp-content/uploads/2022/11/02.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(29, 'Пригощали кавунами, закликали донатити на United24. Підсумки конференції Sigma від Interkassa', 'Фінтехкомпанія Interkassa презентувала свої платіжні рішення і продукти на найбільшій у світі iGaming-події Sigma, що відбулася на Мальті. На власному стенді Interkassa збирала донати на підтримку України через платформу United24, дарувала вишиванки і пригощала кавунами на честь звільненого Херсону. ', 'https://highload.today/wp-content/uploads/2022/11/1-12-e1669732963432.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(30, 'Як стати фронтенд-розробником та отримувати $3 тис.? Розповідаємо, що він має вміти і де цьому навчають', 'Якщо вам цікаве програмування і ви хочете, щоб результат роботи могли оцінити користувачі, зверніть увагу на професію фронтенд-розробника. Саме він розробляє частину сайту, яку бачать користувачі.', 'https://highload.today/wp-content/uploads/2022/11/imgonline-com-ua-Resize-G8uaz6Nd2TK.jpg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(31, 'Робота на Штати з українського дивану: 14 сайтів з віддаленими вакансіями за кордоном', 'Запорука успішного працевлаштування в IT сьогодні — активність: чим більше ресурсів, де опубліковано ваше резюме, тим вищий шанс знайти роботу. Підкинемо вам ще 14 таких платформ.', 'https://highload.today/wp-content/uploads/2022/11/uvavmchs.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(32, 'Пережити блекаут: як українські IT-компанії дають раду з відсутністю світла та зв’язку', 'У зв’язку з масовими обстрілами українських міст та об’єктів критичної інфраструктури перед ІТ-індустрією виникли нові ризики, пов’язані з відсутністю інтернету, енергопостачання, мобільного зв’язку. Всіх хвилює питання: як пережити цю зиму та забезпечити безперервність делівері.', 'https://highload.today/wp-content/uploads/2022/11/Depositphotos_414644648_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(33, 'Спеціальний фонд, платформи для держорганів і IT-навчання: 17 соціальних проєктів ЕРАМ до 17-річчя компанії в Україні', 'Цього року представництву ЕРАМ в Україні виповнюється 17 років. З цієї нагоди в компанії згадали 17 знакових соціальних проєктів, які вони реалізують для підтримки України у 2022 році. ', 'https://highload.today/wp-content/uploads/2022/11/Group-198.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(34, '«Тімлід зірвався на мене»: як я 8 місяців шукав роботу в IT (і про темну сторону співбесід)', 'Працевлаштування в IT без досвіду be like: 8 місяців спроб, десятки співбесід, сотні відправлених CV, і ось вона перша робота! Таку історію розповів Junior QA Engineer в Avirise Кирило Вечеринській.', 'https://highload.today/wp-content/uploads/2022/11/UKU.png', '2022-12-14 12:57:50', '2022-12-14 12:57:50'),
(35, 'Це має знати кожний розробник: навіщо потрібна архітектура ПЗ та які проблеми вона вирішує', 'Розбиратися в архітектурі хоча б на базовому рівні варто кожному розробнику. Нехай моя стаття стане відправною точкою у вивченні цієї теми. Я розповім, які проблеми у розробці вирішує правильно підібрана архітектура, а також опишу її реалізацію за допомогою портів та адаптерів.', 'https://highload.today/wp-content/uploads/2022/11/Depositphotos_240771618_L.jpeg', '2022-12-14 12:57:50', '2022-12-14 12:57:50');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `doctrine_migration_versions`
--
ALTER TABLE `doctrine_migration_versions`
  ADD PRIMARY KEY (`version`);

--
-- Indexes for table `messenger_messages`
--
ALTER TABLE `messenger_messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `IDX_75EA56E0FB7336F0` (`queue_name`),
  ADD KEY `IDX_75EA56E0E3BD61CE` (`available_at`),
  ADD KEY `IDX_75EA56E016BA31DB` (`delivered_at`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `messenger_messages`
--
ALTER TABLE `messenger_messages`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
